RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_ospi.c
/*!
    \brief      configure alternate bytes mode (API_ID: 0x0034U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_ALTEMOD | OSPI_TCFG_ALTESZ | OSPI_TCFG_ABDTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_TCFG_ALTEMOD) | (altesz & OSPI_TCFG_ALTESZ) | (abdtr & OSPI_TCFG_ABDTR));
    OSPI_ALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_ALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure data mode (API_ID: 0x0035U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_TCFG_DATAMOD) | (dadtr & OSPI_TCFG_DADTR));
}

/*!
    \brief      OSPI transmit data (API_ID: 0x0036U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  data: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_data_transmit(uint32_t ospi_periph, uint32_t data)
{
    OSPI_DATA(ospi_periph) = (uint32_t)data;
}

/*!
    \brief      OSPI receive data (API_ID: 0x0037U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     between 0 and 0xFFFFFFFF
*/
uint32_t ospi_data_receive(uint32_t ospi_periph)
{
    return ((uint32_t)OSPI_DATA(ospi_periph));
}

/*!
    \brief      enable OSPI MDMA (API_ID: 0x0038U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_mdma_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_MDMAEN;
}

/*!
    \brief      disable OSPI MDMA (API_ID: 0x0039U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_mdma_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_MDMAEN);
}

/*!
    \brief      abort the current transmission (API_ID: 0x003AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_transmission_abort(uint32_t ospi_periph)
{
    /* check if the MDMA is enabled */
    if(RESET != (OSPI_CTL(ospi_periph) & OSPI_CTL_MDMAEN)) {
        /* disable the MDMA transfer on the OSPI side */
        OSPI_CTL(ospi_periph) &= ~OSPI_CTL_MDMAEN;
    }

    if(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
        /* perform an abort of the OSPI */
        OSPI_CTL(ospi_periph) |= OSPI_CTL_ABORT;

        /* wait until the transfer complete flag is set to go back in idle state */
        while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
        }

        /* clear transfer complete flag */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;

        /* wait until the busy flag is reset to go back in idle state */
        while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
        }
    }
}

/*!
    \brief      abort the current transmission (API_ID: 0x003BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_interrupt_transmission_abort(uint32_t ospi_periph)
{
    /* disable all interrupts */
    OSPI_CTL(ospi_periph) &= ~(OSPI_CTL_TERRIE | OSPI_CTL_TCIE | OSPI_CTL_FTIE | OSPI_CTL_SMIE | OSPI_CTL_TMOUTIE);

    /* check if the DMA is enabled */
    if(RESET != (OSPI_CTL(ospi_periph) & OSPI_CTL_MDMAEN)) {
        /* disable the DMA transfer on the OctoSPI side */
        OSPI_CTL(ospi_periph) &= ~OSPI_CTL_MDMAEN;
    } else {
        if(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
            /* clear transfer complete flag */
            OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;

            /* enable the transfer complete interrupts */
            OSPI_CTL(ospi_periph) |= OSPI_CTL_TCIE;

            /* perform an abort of the OctoSPI */
            OSPI_CTL(ospi_periph) |= OSPI_CTL_ABORT;
        }
    }
}

/*!
    \brief      configure wrap instruction mode (API_ID: 0x003CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  imod: OSPI instruction mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_NONE: no instruction mode
      \arg        OSPI_INSTRUCTION_1_LINE: instruction mode on a single line
      \arg        OSPI_INSTRUCTION_2_LINES: instruction mode on two lines
      \arg        OSPI_INSTRUCTION_4_LINES: instruction mode on four lines
      \arg        OSPI_INSTRUCTION_8_LINES: instruction mode on eight lines
    \param[in]  insdtr: OSPI instruction double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSDTR_MODE_DISABLE: instruction double transfer rate mode disable
      \arg        OSPI_INSDTR_MODE_ENABLE: instruction double transfer rate mode enable
    \param[in]  inssz: OSPI instruction size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_8_BITS: instruction size on 8-bit address
      \arg        OSPI_INSTRUCTION_16_BITS: instruction size on 16-bit address
      \arg        OSPI_INSTRUCTION_24_BITS: instruction size on 24-bit address
      \arg        OSPI_INSTRUCTION_32_BITS: instruction size on 32-bit address
    \param[in]  instruction: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_IMOD | OSPI_WPTCFG_INSSZ | OSPI_WPTCFG_INSDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((imod & OSPI_WPTCFG_IMOD) | (inssz & OSPI_WPTCFG_INSSZ) | (insdtr & OSPI_WPTCFG_INSDTR));
    OSPI_WPINS(ospi_periph) &= (uint32_t)(~OSPI_INS_INSTRUCTION);
    OSPI_WPINS(ospi_periph) |= (uint32_t)(instruction & OSPI_INS_INSTRUCTION);
}

/*!
    \brief      configure wrap address mode (API_ID: 0x003DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  addrmod: OSPI address mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_NONE: no address mode
      \arg        OSPI_ADDRESS_1_LINE: address mode on a single line
      \arg        OSPI_ADDRESS_2_LINES: address mode on two lines
      \arg        OSPI_ADDRESS_4_LINES: address mode on four lines
      \arg        OSPI_ADDRESS_8_LINES: address mode on eight lines
    \param[in]  addrdtr: OSPI address double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRDTR_MODE_DISABLE: address double transfer rate mode disable
      \arg        OSPI_ADDRDTR_MODE_ENABLE: address double transfer rate mode enable
    \param[in]  addrsz: OSPI address size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_8_BITS: address size on 8-bit address
      \arg        OSPI_ADDRESS_16_BITS: address size on 16-bit address
      \arg        OSPI_ADDRESS_24_BITS: address size on 24-bit address
      \arg        OSPI_ADDRESS_32_BITS: address size on 32-bit address
    \param[in]  addr: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_ADDRMOD | OSPI_WPTCFG_ADDRSZ | OSPI_WPTCFG_ADDRDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((addrmod & OSPI_WPTCFG_ADDRMOD) | (addrsz & OSPI_WPTCFG_ADDRSZ) | (addrdtr & OSPI_WPTCFG_ADDRDTR));
    OSPI_ADDR(ospi_periph) &= (uint32_t)(~OSPI_ADDR_ADDR);
    OSPI_ADDR(ospi_periph) |= (uint32_t)(addr & OSPI_ADDR_ADDR);
}

/*!
    \brief      configure wrap alternate bytes mode (API_ID: 0x003EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_ALTEMOD | OSPI_WPTCFG_ALTESZ | OSPI_WPTCFG_ABDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_WPTCFG_ALTEMOD) | (altesz & OSPI_WPTCFG_ALTESZ) | (abdtr & OSPI_WPTCFG_ABDTR));
    OSPI_WPALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_WPALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure wrap data mode (API_ID: 0x003FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_wrap_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_DATAMOD | OSPI_WPTCFG_DADTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_WPTCFG_DATAMOD) | (dadtr & OSPI_WPTCFG_DADTR));
}

/*!
    \brief      enable OSPI wrap DQS mode (API_ID: 0x0040U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dqs_enable(uint32_t ospi_periph)
{
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)OSPI_WPTCFG_DQSEN;
}

/*!
    \brief      disable OSPI wrap DQS mode (API_ID: 0x0041U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dqs_disable(uint32_t ospi_periph)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)(~OSPI_WPTCFG_DQSEN);
}

/*!
    \brief      configure wrap dummy cycles number (API_ID: 0x0042U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dumyc: number of dummy cycles
      \arg        OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc)
{
    OSPI_WPTIMCFG(ospi_periph) &= (uint32_t)(~OSPI_WPTIMCFG_DUMYC);
    OSPI_WPTIMCFG(ospi_periph) |= (uint32_t)(dumyc & OSPI_WPTIMCFG_DUMYC);
}

/*!
    \brief      configure write instruction mode (API_ID: 0x0043U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  imod: OSPI instruction mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_NONE: no instruction mode
      \arg        OSPI_INSTRUCTION_1_LINE: instruction mode on a single line
      \arg        OSPI_INSTRUCTION_2_LINES: instruction mode on two lines
      \arg        OSPI_INSTRUCTION_4_LINES: instruction mode on four lines
      \arg        OSPI_INSTRUCTION_8_LINES: instruction mode on eight lines
    \param[in]  insdtr: OSPI instruction double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSDTR_MODE_DISABLE: instruction double transfer rate mode disable
      \arg        OSPI_INSDTR_MODE_ENABLE: instruction double transfer rate mode enable
    \param[in]  inssz: OSPI instruction size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_8_BITS: instruction size on 8-bit address
      \arg        OSPI_INSTRUCTION_16_BITS: instruction size on 16-bit address
      \arg        OSPI_INSTRUCTION_24_BITS: instruction size on 24-bit address
      \arg        OSPI_INSTRUCTION_32_BITS: instruction size on 32-bit address
    \param[in]  instruction: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_IMOD | OSPI_WTCFG_INSSZ | OSPI_WTCFG_INSDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((imod & OSPI_WTCFG_IMOD) | (inssz & OSPI_WTCFG_INSSZ) | (insdtr & OSPI_WTCFG_INSDTR));
    OSPI_WINS(ospi_periph) &= (uint32_t)(~OSPI_INS_INSTRUCTION);
    OSPI_WINS(ospi_periph) |= (uint32_t)(instruction & OSPI_INS_INSTRUCTION);
}

/*!
    \brief      configure write address mode (API_ID: 0x0044U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  addrmod: OSPI address mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_NONE: no address mode
      \arg        OSPI_ADDRESS_1_LINE: address mode on a single line
      \arg        OSPI_ADDRESS_2_LINES: address mode on two lines
      \arg        OSPI_ADDRESS_4_LINES: address mode on four lines
      \arg        OSPI_ADDRESS_8_LINES: address mode on eight lines
    \param[in]  addrdtr: OSPI address double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRDTR_MODE_DISABLE: address double transfer rate mode disable
      \arg        OSPI_ADDRDTR_MODE_ENABLE: address double transfer rate mode enable
    \param[in]  addrsz: OSPI address size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_8_BITS: address size on 8-bit address
      \arg        OSPI_ADDRESS_16_BITS: address size on 16-bit address
      \arg        OSPI_ADDRESS_24_BITS: address size on 24-bit address
      \arg        OSPI_ADDRESS_32_BITS: address size on 32-bit address
    \param[in]  addr: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_ADDRMOD | OSPI_WTCFG_ADDRSZ | OSPI_WTCFG_ADDRDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((addrmod & OSPI_WTCFG_ADDRMOD) | (addrsz & OSPI_WTCFG_ADDRSZ) | (addrdtr & OSPI_WTCFG_ADDRDTR));
    OSPI_ADDR(ospi_periph) &= (uint32_t)(~OSPI_ADDR_ADDR);
    OSPI_ADDR(ospi_periph) |= (uint32_t)(addr & OSPI_ADDR_ADDR);
}

/*!
    \brief      configure write alternate bytes mode (API_ID: 0x0045U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_ALTEMOD | OSPI_WTCFG_ALTESZ | OSPI_WTCFG_ABDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_WTCFG_ALTEMOD) | (altesz & OSPI_WTCFG_ALTESZ) | (abdtr & OSPI_WTCFG_ABDTR));
    OSPI_WALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_WALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure write data mode (API_ID: 0x0046U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_write_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_DATAMOD | OSPI_WTCFG_DADTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_WTCFG_DATAMOD) | (dadtr & OSPI_WTCFG_DADTR));
}

/*!
    \brief      enable OSPI write DQS mode (API_ID: 0x0047U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_dqs_enable(uint32_t ospi_periph)
{
    OSPI_WTCFG(ospi_periph) |= (uint32_t)OSPI_WTCFG_DQSEN;
}

/*!
    \brief      disable OSPI write DQS mode (API_ID: 0x0048U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_dqs_disable(uint32_t ospi_periph)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)(~OSPI_WTCFG_DQSEN);
}

/*!
    \brief      configure write dummy cycles number (API_ID: 0x0049U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dumyc: number of dummy cycles
      \arg        OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
    \param[out] none
    \retval     none
*/
void ospi_write_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc)
{
    OSPI_WTIMCFG(ospi_periph) &= (uint32_t)(~OSPI_WTIMCFG_DUMYC);
    OSPI_WTIMCFG(ospi_periph) |= (uint32_t)(dumyc & OSPI_WTIMCFG_DUMYC);
}

/*!
    \brief      hyperbus latency mode (API_ID: 0x004AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  lmod: OSPI latency mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_VAR_INIT_LATENCY: variable initial latency mode
      \arg        OSPI_FIXED_LATENCY: fixed latency mode
    \param[out] none
    \retval     none
*/
void ospi_latency_mode_config(uint32_t ospi_periph, uint32_t lmod)
{
    OSPI_HBLCFG(ospi_periph) &= (uint32_t)(~OSPI_HBLCFG_LMOD);
    OSPI_HBLCFG(ospi_periph) |= (uint32_t)(lmod & OSPI_HBLCFG_LMOD);
}

/*!
    \brief      enable write zero latency (API_ID: 0x004BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_zero_latency_enable(uint32_t ospi_periph)
{
    OSPI_HBLCFG(ospi_periph) |= (uint32_t)OSPI_HBLCFG_WZLAT;
}

/*!
    \brief      disable write zero latency (API_ID: 0x004CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_zero_latency_disable(uint32_t ospi_periph)
{
    OSPI_HBLCFG(ospi_periph) &= (uint32_t)(~OSPI_HBLCFG_WZLAT);
}

