RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_ospi.c
/*!
    \brief      configure OSPI regular command parameter (API_ID: 0x004DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        sample_delay: OSPI_SAMPLE_DELAY_DISABLE, OSPI_SAMPLE_DELAY_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  cmd_struct: structure that contains the command configuration information
                            and the member values are shown as below:
      \arg        operation_type: OSPI_OPTYPE_COMMON_CFG, OSPI_OPTYPE_READ_CFG
                                  OSPI_OPTYPE_WRITE_CFG, OSPI_OPTYPE_WRAP_CFG
      \arg        device_id: OSPI_DEVICE0_SELECT, OSPI_DEVICE1_SELECT
      \arg        instruction: between 0 and 0xFFFFFFFF
      \arg        ins_mode: OSPI_INSTRUCTION_NONE, OSPI_INSTRUCTION_1_LINE, OSPI_INSTRUCTION_2_LINES
                            OSPI_INSTRUCTION_4_LINES, OSPI_INSTRUCTION_8_LINES
      \arg        ins_size: OSPI_INSTRUCTION_8_BITS, OSPI_INSTRUCTION_16_BITS
                            OSPI_INSTRUCTION_24_BITS, OSPI_INSTRUCTION_32_BITS
      \arg        ins_dtr_mode: OSPI_INSDTR_MODE_DISABLE, OSPI_INSDTR_MODE_ENABLE
      \arg        address: between 0 and 0xFFFFFFFF
      \arg        addr_mode: OSPI_ADDRESS_NONE, OSPI_ADDRESS_1_LINE, OSPI_ADDRESS_2_LINES
                             OSPI_ADDRESS_4_LINES, OSPI_ADDRESS_8_LINES
      \arg        addr_size: OSPI_ADDRESS_8_BITS, OSPI_ADDRESS_16_BITS
                             OSPI_ADDRESS_24_BITS, OSPI_ADDRESS_32_BITS
      \arg        addr_dtr_mode: OSPI_ADDRDTR_MODE_DISABLE, OSPI_ADDRDTR_MODE_ENABLE
      \arg        alter_bytes: between 0 and 0xFFFFFFFF
      \arg        alter_bytes_mode: OSPI_ALTERNATE_BYTES_NONE, OSPI_ALTERNATE_BYTES_1_LINE
                                    OSPI_ALTERNATE_BYTES_2_LINES, OSPI_ALTERNATE_BYTES_4_LINES
                                    OSPI_ALTERNATE_BYTES_8_LINES
      \arg        alter_bytes_size: OSPI_ALTERNATE_BYTES_8_BITS, OSPI_ALTERNATE_BYTES_16_BITS
                                    OSPI_ALTERNATE_BYTES_24_BITS, OSPI_ALTERNATE_BYTES_32_BITS
      \arg        alter_bytes_dtr_mode: OSPI_ABDTR_MODE_DISABLE, OSPI_ABDTR_MODE_ENABLE
      \arg        data_mode: OSPI_DATA_NONE, OSPI_DATA_1_LINE, OSPI_DATA_2_LINES
                             OSPI_DATA_4_LINES, OSPI_DATA_8_LINES
      \arg        nbdata: between 1 and 0xFFFFFFFF
      \arg        data_dtr_mode: OSPI_DADTR_MODE_DISABLE, OSPI_DADTR_MODE_ENABLE
      \arg        dummy_cycles: OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
      \arg        dqs_mode: OSPI_DQSEN_DISABLE, OSPI_DQSEN_ENABLE
      \arg        sioo_mode: OSPI_SIOO_INST_EVERY_CMD, OSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
*/
void ospi_command_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_regular_cmd_struct *cmd_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004DU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cmd_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((ospi_struct->memory_type != OSPI_HYPERBUS_MEMORY_MODE) || ((cmd_struct->operation_type == OSPI_OPTYPE_WRITE_CFG) ||
                (cmd_struct->operation_type == OSPI_OPTYPE_WRAP_CFG)) || ((cmd_struct->operation_type == OSPI_OPTYPE_READ_CFG)  ||
                        (cmd_struct->operation_type == OSPI_OPTYPE_COMMON_CFG))) {
            /* wait till busy flag is reset */
            while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
            }

            /* configure the registers */
            ospi_config(ospi_periph, ospi_struct, cmd_struct);

            if(cmd_struct->data_mode == OSPI_DATA_NONE) {
                /* when there is no data phase, the transfer start as soon as the configuration is done
                so wait until TC flag is set to go back in idle state */
                while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
                }

                OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;
            }
        }
    }
}

/*!
    \brief      configure the hyperbus parameters (API_ID: 0x004EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  hyperbus_cfg_struct: structure containing the hyperbus configuration
                                     and the member values are shown as below:
      \arg        rw_recovery_time: between 0 and 255
      \arg        access_time: between 0 and 255
      \arg        write_zero_latency: OSPI_WRITE_ZERO_LATENCY_DISABLE, OSPI_WRITE_ZERO_LATENCY_ENABLE
      \arg        latency_mode: OSPI_VAR_INIT_LATENCY, OSPI_FIXED_LATENCY
    \param[out] none
    \retval     none
*/
void ospi_hyperbus_config(uint32_t ospi_periph, ospi_hyperbus_cfg_struct *hyperbus_cfg_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(hyperbus_cfg_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* wait till busy flag is reset */
      while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)){
      }

        /* configure hyperbus configuration latency register */
        OSPI_HBLCFG(ospi_periph) &= ~(OSPI_HBLCFG_RWRTM | OSPI_HBLCFG_ACCTM | OSPI_HBLCFG_WZLAT | OSPI_HBLCFG_LMOD);
        OSPI_HBLCFG(ospi_periph) |= OSPI_RWRTM(hyperbus_cfg_struct->rw_recovery_time) | OSPI_ACCTM(hyperbus_cfg_struct->access_time) |
                                   hyperbus_cfg_struct->write_zero_latency | hyperbus_cfg_struct->latency_mode;
    }
}

/*!
    \brief      set the hyperbus command configuration (API_ID: 0x004FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        sample_delay: OSPI_SAMPLE_DELAY_DISABLE, OSPI_SAMPLE_DELAY_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  hyperbus_cmd_struct: structure containing the hyperbus command
                                     and the member values are shown as below:
      \arg        addr_space: OSPI_MEMORY_ADDRESS_SPACE, OSPI_REGISTER_ADDRESS_SPACE
      \arg        address: between 0 and 0xFFFFFFFF
      \arg        addr_size: OSPI_ADDRESS_8_BITS, OSPI_ADDRESS_16_BITS
      \arg                      OSPI_ADDRESS_24_BITS, OSPI_ADDRESS_32_BITS
      \arg        nbdata: between between 1 and 0xFFFFFFFF
      \arg        dqs_mode: OSPI_DQS_DISABLE, OSPI_DQS_ENABLE
    \param[out] none
    \retval     none
*/
void ospi_hyperbus_cmd_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_hyperbus_cmd_struct *hyperbus_cmd_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004FU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(hyperbus_cmd_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* Check the state of the driver */
        if(ospi_struct->memory_type == OSPI_HYPERBUS_MEMORY_MODE) {
            /* wait till busy flag is reset */
          while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)){
          }

