RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_ospi.c
            /* re-initialize the value of the functional mode */
            OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FMOD);

            /* Configure the address space in the DCFG0 register */
            OSPI_DCFG0(ospi_periph) = (OSPI_DCFG0(ospi_periph) & ~OSPI_RESERVE_MODE) | hyperbus_cmd_struct->addr_space;

            /* configure the TCFG and WTCFG registers with the address size and the following configuration :
             - DQS signal enabled (used as RWDS)
             - DTR mode enabled on address and data
             - address and data on 8 lines */
            OSPI_TCFG(ospi_periph) &= ~(OSPI_TCFG_DQSEN | OSPI_TCFG_DADTR | OSPI_TCFG_DATAMOD | OSPI_TCFG_ADDRSZ | 
                                        OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRMOD);
            OSPI_TCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                      hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

            OSPI_WTCFG(ospi_periph) &= ~(OSPI_WTCFG_DQSEN | OSPI_WTCFG_DADTR | OSPI_WTCFG_DATAMOD | OSPI_WTCFG_ADDRSZ | 
                                        OSPI_WTCFG_ADDRDTR | OSPI_WTCFG_ADDRMOD);
            OSPI_WTCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                       hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

            OSPI_WPTCFG(ospi_periph) &= ~(OSPI_WPTCFG_DQSEN | OSPI_WPTCFG_DADTR | OSPI_WPTCFG_DATAMOD | OSPI_WPTCFG_ADDRSZ | 
                                        OSPI_WPTCFG_ADDRDTR | OSPI_WPTCFG_ADDRMOD);
            OSPI_WPTCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                       hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

            /* configure the DTLEN register with the number of data */
            OSPI_DTLEN(ospi_periph) = hyperbus_cmd_struct->nbdata - 1U;

            /* configure the ADDR register with the address value */
            OSPI_ADDR(ospi_periph) = hyperbus_cmd_struct->address;
        }
    }
}

/*!
    \brief      transmit an amount of data in blocking mode (API_ID: 0x0050U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  pdata: pointer to data buffer
    \param[out] none
    \note       this function is used only in indirect write mode
    \retval     none
*/
void ospi_transmit(uint32_t ospi_periph, uint8_t *pdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pdata)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t txcounter;
        uint32_t address;
        /* configure counters and size */
        txcounter = OSPI_DTLEN(ospi_periph) + 1U;
        address = (uint32_t)pdata;

        /* configure CTL register with functional mode as indirect write */
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FMOD) | OSPI_INDIRECT_WRITE;

        do {
              /* wait till FIFO threshold flag is set to send data */
            while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_FT)) {
            }

            *((__IO uint8_t *)&OSPI_DATA(ospi_periph)) = *(uint8_t *)address;
            address++;
            txcounter--;
        } while(txcounter > 0U);

        /* wait till transfer complete flag is set to go back in idle state */
        while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
        }

        /* clear transfer complete flag */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;
    }
}

/*!
    \brief      receive an amount of data in blocking mode (API_ID: 0x0051U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        sample_delay: OSPI_SAMPLE_DELAY_DISABLE, OSPI_SAMPLE_DELAY_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  pdata: pointer to data buffer
    \param[out] none
    \note       this function is used only in indirect read mode
    \retval     none
*/
void ospi_receive(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, uint8_t *pdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0051U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(pdata)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0051U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t rxcounter;
        uint32_t address;
        uint32_t addr_reg = OSPI_ADDR(ospi_periph);
        uint32_t ins_reg = OSPI_INS(ospi_periph);

